import java.util.Scanner;

/*
—оздать приложение Ђ оллекци€ текстовых документовї.
ѕроект должен позвол€ть выполн€ть базовые операции с текстовыми документами:
 открытие документа (если содержимое документа не помещаетс€ на
одном экране, нужно организовать постраничный вывод с возможностью перехода
вперед или назад на одну страницу), поиск по документу (пользователь вводит
слово дл€ поиска, после чего производитс€ поиск, вывод результатов должен быть
осуществлен с возможностью перехода на следующее или предыдущее место, где
найдено искомое слово/ комбинаци€ слов), замена слова или комбинации слов в
документе, создание нового документа. ѕри старте проекта отображаетс€ структура коллекции.
 роме уже перечисленных возможностей, пользователь может задать корневую папку коллекции,
посмотреть свойства документа (размер, автор, дата создани€), сортировать коллекцию документов
 (по размеру, автору, дате создани€).
»нтерфейс приложени€ должен позвол€ть выводить результат работы приложени€ в консоль или файл.
 ѕриложение должно поддерживать интерфейс командной строки.
 */
public class Main {

    public static void main(String[] args) {
        new ConsoleApplication().run();

    }


}